#2. По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b,
# проходящей через эти точки.

X1 = float(input("Введите координату X первой точки: "))
Y1 = float(input("Введите координату Y первой точки: "))
X2 = float(input("Введите координату X второй точки: "))
Y2 = float(input("Введите координату Y второй точки: "))

if X1 == X2 and Y1 == Y2:
    print('Задана только одна точка')
elif X1 == X2:
    print(f'x = {X1}')
elif Y1 == Y2:
    print(f'y = {Y1}')
else:
    k = (Y2-Y1)/(X2-X1)
    b = Y1 - k*X1
    if b == 0:
        print(f'y = {k}x')
    elif b < 0:
        print(f'y = {k}x{b}')
    else:
        print(f'y = {k}x+{b}')

