#1. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

a = 5 & 6
b = 5 | 6
c = 5 ^ 6
d = ~a

print(f"\nПобитовое 'И' над 5 и 6: {5:b} & {6:b} = {a:b}")
print(f"Побитовое 'ИЛИ' над 5 и 6: {5:b} | {6:b} = {b:b}")
print(f"Побитовое 'Исключающее ИЛИ' над 5 и 6: {5:b} ^ {6:b} = {c:b}")
print(f"Побитовое 'И-НЕ' над 5 и 6: ~({5:b} & {6:b}) = {d:b}")
print(f"Побитовый сдвиг 5 вправо на 2: {5:b} >> 2 = {5 >> 2:b}")
print(f"Побитовый сдвиг 5 влево на 2: {5:b} << 2 = {5 << 2:b}")
